export default [
  // 爱心顶部顶点 (内蒙古锡林郭勒)
  {
    id: '1',
    jd: 116.097772, // 锡林浩特经度
    wd: 43.944301, // 锡林浩特纬度
    fdlx: 1,
    fcNickname: '宋江风电场',
    zjrl: 250,
    areaCode: '152502' // 锡林郭勒盟锡林浩特市
  },

  // 爱心左侧弧线 (新疆哈密→青海→四川)
  {
    id: '2',
    jd: 93.513076, // 哈密经度
    wd: 42.833248, // 哈密纬度
    fdlx: 2,
    fcNickname: '卢俊义风电场',
    zjrl: 300,
    fcType: 1,
    areaCode: '650502' // 哈密伊州区
  },
  {
    id: '3',
    jd: 100.901358, // 青海海北经度
    wd: 36.960654, // 海北纬度
    fdlx: 2,
    fcNickname: '吴用风电场',
    zjrl: 280,
    fcType: 2,
    areaCode: '632221' // 海北门源县
  },
  {
    id: '4',
    jd: 102.258758, // 四川攀枝花经度
    wd: 26.582348, // 攀枝花纬度
    fdlx: 1,
    fcNickname: '公孙胜风电场',
    zjrl: 270,
    areaCode: '510402' // 攀枝花东区
  },

  // 爱心右侧弧线 (黑龙江→吉林→山东→湖北)
  {
    id: '5',
    jd: 126.642464, // 哈尔滨经度
    wd: 45.756967, // 哈尔滨纬度
    fdlx: 2,
    fcNickname: '关胜风电场',
    zjrl: 320,
    fcType: 1,
    areaCode: '230102' // 哈尔滨道里区
  },
  {
    id: '6',
    jd: 124.823417, // 吉林松原经度
    wd: 45.136049, // 松原纬度
    fdlx: 1,
    fcNickname: '林冲风电场',
    zjrl: 290,
    areaCode: '220702' // 松原宁江区
  },
  {
    id: '7',
    jd: 117.020725, // 山东临沂经度
    wd: 35.051634, // 临沂纬度
    fdlx: 2,
    fcNickname: '秦明风电场',
    zjrl: 310,
    fcType: 2,
    areaCode: '371302' // 临沂兰山区
  },
  {
    id: '8',
    jd: 114.875333, // 湖北黄冈经度
    wd: 30.453667, // 黄冈纬度
    fdlx: 1,
    fcNickname: '呼延灼风电场',
    zjrl: 300,
    areaCode: '421102' // 黄冈黄州区
  },

  // 爱心底部中心强化 (重庆→贵州→湖南)
  {
    id: '9',
    jd: 108.380246, // 重庆经度
    wd: 30.807807, // 重庆纬度
    fdlx: 2,
    fcNickname: '花荣风电场',
    zjrl: 260,
    fcType: 1,
    areaCode: '500103' // 重庆渝中区
  },
  {
    id: '10',
    jd: 107.031856, // 贵州遵义经度
    wd: 27.721209, // 遵义纬度
    fdlx: 1,
    fcNickname: '柴进风电场',
    zjrl: 275,
    areaCode: '520302' // 遵义红花岗区
  },
  {
    id: '11',
    jd: 112.982279, // 湖南长沙经度
    wd: 28.19409, // 长沙纬度
    fdlx: 2,
    fcNickname: '李逵风电场',
    zjrl: 285,
    fcType: 2,
    areaCode: '430105' // 长沙开福区
  },

  // 新增关键过渡点 (北京→河南→陕西)
  {
    id: '12',
    jd: 116.405285, // 北京经度
    wd: 39.904989, // 北京纬度
    fdlx: 1,
    fcNickname: '鲁智深风电场',
    zjrl: 330,
    areaCode: '110101' // 北京东城区
  },
  {
    id: '13',
    jd: 113.625368, // 河南驻马店经度
    wd: 33.011529, // 驻马店纬度
    fdlx: 2,
    fcNickname: '武松风电场',
    zjrl: 295,
    fcType: 1,
    areaCode: '411702' // 驻马店驿城区
  },
  {
    id: '14',
    jd: 108.948024, // 陕西西安经度
    wd: 34.263161, // 西安纬度
    fdlx: 1,
    fcNickname: '董平风电场',
    zjrl: 305,
    areaCode: '610104' // 西安莲湖区
  }
]
